Revit 2024 API
View.CreateViewTemplate Method
 Creates a new view template instance from this view instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public View CreateViewTemplate()
Visual Basic
Public Function CreateViewTemplate As View
Visual C++
public:
View^ CreateViewTemplate()
Return Value
 New view template instance
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The view is not valid for view template creation.
See Also
View Class
Autodesk.Revit.DB Namespace